/**
 *
 * @author SeASon
 * 语言包
 *
 */
class Lang {
	public constructor() {}
    
    public static ROLE_NAME = {
        MERLIN:{
            CN:"梅林",
            SIGN:"梅",
            TIPS:"梅林",
            HELP:"你能看到除了莫德雷德外的所有红方。请暗中带领蓝方顺利完成任务，并隐藏自己",
            CAMP: true
        },
        PERCIVAL:{
            CN: "派西维尔",
            SIGN: "派",
            TIPS: "派西维尔",
            HELP: "你是蓝方的领队，尽快辨识梅林和莫甘娜，切勿暴露梅林，引导蓝方走向胜利",
            CAMP: true
        },
        LOYAL:{
            CN: "亚瑟忠臣",
            SIGN: "忠",
            TIPS: "忠臣",
            HELP: "你看不到任何身份，分析、判断跟对队伍，寻找蓝方，和梅林演一出戏",
            CAMP: true
        },
        MORDRED:{
            CN: "莫德蕾德",
            SIGN: "德",
            TIPS: "莫德雷德",
            HELP: "红方老大，你能看到红方，并且梅林无法看到你",
            CAMP: false
        },
        MORGANA:{
            CN: "莫甘娜",
            SIGN: "娜",
            TIPS: "莫甘娜",
            HELP: "你是红方的核心，你能看到红方，并伪装梅林，混淆视听",
            CAMP: false
        },
        ASSASSIN:{
            CN: "刺客",
            SIGN: "刺",
            TIPS: "刺客",
            HELP: "你是红方的翻盘机会，能看到红方，破坏任务之余，准确刺杀梅林",
            CAMP: false
        },
        OBERON:{
            CN: "奥伯伦",
            SIGN: "奥",
            TIPS: "奥伯伦",
            HELP: "你是孤立的红方成员，尽快找到队友，并破坏任务",
            CAMP: false
        },
        PAWN:{
            CN: "邪恶爪牙",
            SIGN: "爪",
            TIPS: "爪牙",
            HELP: "作为一名平凡的红方成员，尽情的破坏任务吧",
            CAMP: false
        },
        UNKNOW:{
            CN: "？身份",
            SIGN: "",
            TIPS: "",
            HELP: "",
            CAMP: true
        },
        MERLIN_OR_MORGANA:{
            CN: "  梅？莫？",
            SIGN: "",
            TIPS: "",
            HELP: "",
            CAMP: true
        },
        LANCELOT:{
            CN: "兰斯洛特",
            SIGN: "兰",
            TIPS: "",
            HELP: "",
            CAMP: true
        },
        LANCELOT_BLUE:{
            CN: "兰斯洛特",
            SIGN: "兰",
            TIPS: "正兰",
            HELP: "作为蓝方的骑士，需要尽快让蓝方辨识自己",
            CAMP: true
        },
        LANCELOT_RED:{
            CN: "兰斯洛特",
            SIGN: "兰",
            TIPS: "邪兰",
            HELP: "你是红方的骑士，红方能看到你，但你却要尽早认出他们",
            CAMP: false
        },
        RESISTANCE: {
            CN: "抵抗军",
            SIGN: "抗",
            TIPS: "抵抗军成员",
            HELP: "找出并联合其他蓝方成员，防止红方破坏任务",
            CAMP: true
        },
        EMPIRE: {
            CN: "间谍",
            SIGN: "谍",
            TIPS: "帝国军间谍",
            HELP: "阻碍蓝方联手，破坏任务",
            CAMP: false
        }
    }

    /**
     * 客户端随机圆桌名
     */
    public static RANDOM_TABLE_NAME: Array<string> = [
        "来玩别走",
        "坐下来喝口茶",
        "等等嘛骑士",
        "有趣的圆桌",
        "亚瑟的圆桌",
        "亚瑟的早餐桌",
        "卡梅洛特议会",
        "侍女的茶话桌",
        "大臣商讨会",
        "皇姐的日常",
        "皇姐的晚餐桌"
    ];
    
    /**
     * 随机名前缀
     */ 
    public static RANDOM_PLAYERNAME_1: Array<string> = [
        "亚瑟的",
        "我是",
        "我才是",
        "我就是",
        "我也是",
        "你是",
        "你才是",
        "你就是",
        "假的",
        "消失的",
        "装傻的",
        "镜像之",
        "魔法的",
        "阿瓦隆的",
        "乌瑟的",
        "卡美洛的",
        "耀眼的",
        "闪光的",
        "华丽的",
        "闪耀的",
        "长得像",
        "有点像",
        "隐藏的",
        "年轻的",
        "苦逼的",
        "金闪闪",
        "凌乱的",
        "插刀的",
        "套路的",
        "真诚的",
        "孤立的",
        "挡刀的",
        "懵逼的",
        "悍跳的",
        "卖梅的",
        "冲票的",
        "旁观的",
        "专业的",
        "装的像",
        "正义的",
        "邪恶的",
        "坚固的",
        "生锈的",
        "路过的",
        "美丽的",
        "艳丽的",
        "真正的",
        "熟练的",
        "冒充的",
        "萌新",
        "诚实的",
        "蓝队的",
        "红队的",
        "皇家的",
        "邪恶的",
        "善良的",
        "传说中的",
        "可爱的",
        "萌萌哒",
        "闭眼的",
        "开眼的"
    ];

    /**
     * 随机名后缀
     */
    public static RANDOM_PLAYERNAME_2: Array<string> = [
        "梅林",
        "派",
        "派西",
        "派西维尔",
        "忠臣",
        "水蓝",
        "平民",
        "刺客",
        "大莫",
        "莫德雷德",
        "莫甘娜",
        "小莫",
        "奥伯伦",
        "爪牙",
        "高文",
        "兰斯洛特",
        "水民",
        "子民",
        "皇姐",
        "派哥哥",
        "梅林蜀黍",
        "骑士",
        "守卫",
        "护卫",
        "骑士",
        "女神",
        "湖上女神",
        "好人",
        "11号",
        "老司机",
        "程序猿",
        "策划",
        "美术",
        "设计狮",
        "套路",
        "树袋熊",
        "搅局蓝",
        "搅局红",
        "石中剑",
        "雇佣兵",
        "萌新",
        "坏蛋"
    ];
    
    /**
     * 游戏快捷短语
     */ 
    public static FASTWORD = {
        "跳派": [
            "<跳派>我是派西维尔。",
            "<跳派>派西维尔在这里！",
            "<跳派>我是真派，其余都是假的！",
            "<跳派>我是派，跟我队伍",
            "<跳派>真派在这，其他都是假的！",
            "<跳派>谁跟我对跳派谁就是莫甘娜！",
            "<跳派>我跳派，应该还来得及……吧？",
            "<跳派>看这局面，只有可能我是真派了",
            "<跳派>我是派，这年头队伍好难带",
            "<跳派>不跳不行了，我才是真派啊！",
            "<跳派>一二三四五六七，派西带你做游戏",
            "<跳派>我是派——西——维——尔——",
            "<跳派>我是场上唯一真派，看起来可信，嗯嗯",
            "<跳派>跳派不退水，赶紧抱大腿",
            "<跳派>我是真派，其他的都是西瓜派、芒果派、菠萝派…",
            "<跳派>看这里，这里是派西维尔",
            "<跳派>让派哥哥来带领你们走向光明",
            "<跳派>我是派，谜一样的存在！",
            "<跳派>我跳派，真派的“派”",
            "<跳派>我是真派，先充五百"
        ],
        "退水": [
            "<退水>我的身份上写着“亚瑟的忠臣”",
            "<退水>我是水民，但我不想挡刀",
            "<退水>退水，我退水，我是好人",
            "<退水>我退水，不要污我了",
            "<退水>我只是个萌萌哒忠臣",
            "<退水>我是好人，我老老实实不跳",
            "<退水>我是水民，我跟派走了",
            "<退水>我退水，退水，水……",
            "<退水>这天有多蓝，我就有多蓝，好吧我只是个水民",
            "<退水>我先声明一下我只是个忠臣",
            "<退水>我从来不跳，萌萌的水民路过",
            "<退水>我其实是忠臣我没信息啊",
            "<退水>大家好，我是水蓝，水是水蓝的蓝，蓝是水蓝的水",
            "<退水>自从我退了水，瞬间感觉自己萌萌哒",
            "<退水>我是水民，我想静静，也别问静静是谁",
            "<退水>在下蕾姆蓝，求组",
            "<退水>我就是个开朗活泼的水蓝"
        ],
        "吐槽": [
            "<表情>（摇了摇头）",
            "<表情>（微微点头）",
            "<表情>（打了个喷嚏）",
            "<表情>（炯炯有神的瞪着你）",
            "<表情>（对下家产生了好奇）",
            "<表情>（对上家产生了好奇）",
            "<表情>（叹了一口气）",
            "<表情>（叹了二口气）",
            "<表情>（深深地吸了一口气…）",
            "<表情>（嘴巴张得好大）",
            "<表情>（陷入了思考）",
            "<表情>（目瞪口呆）",
            "<表情>（一脸懵逼）",
            "<表情>（二脸懵逼）",
            "<表情>（向你晃了晃水灵灵的大眼睛）",
            "<表情>（真诚脸）",
            "<表情>（小脸一红）",
            "<表情>（捂脸）",
            "<表情>（喵！）",
            "<表情>（自己用心去体会）",
            "<表情>（开天眼中…）",
            "<表情>（360度挥泪旋转）",
            "<表情>（抱住了对面大腿）",
            "<表情>（望向天花板）",
            "<表情>（尴尬）",
            "<表情>（震惊脸）",
            "<表情>（害怕.jpg）",
            "<表情> ∑(￣□￣*|||",
            "<表情> ╮(￣▽￣)╭",
            "<萌新>我是萌新，萌萌哒！Ｏ(≧口≦)Ｏ",
            "<萌新>新人，求指教",
            "<萌新>老司机带我，新人求上船",
            "<萌新>老司机带带我，阿哩哩阿哩哩阿哩阿哩哩",
            "<萌新>新人求罩，求戏弄<(￣︶￣)>",
            "<萌新>我是萌新，打的不对求讲解",
            "<萌新>萌新光环在此！",
            "<萌新>o(^▽^)o大家好，我是萌新！",
            "<萌新>萌新刚玩，不懂的地方求指导",
            "<萌新>在场的都是高玩，大家幽默撕逼，顺便带上小弟",
            "<萌新>萌新瑟瑟发抖",
            "<萌新>带萌新上船，萌新要下副本",
            "<萌新>萌新大吃一惊",
            "<萌新>大家好，我是萌新卖个萌",
            "<萌新>大家别欺负我这个萌新，欺负我的不绅士！",
            "<吐槽>有理有据让人信服",
            "<吐槽>说的好有道理，我竟无言以对…",
            "<吐槽>我随口一说都别当真",
            "<吐槽>这投个票好难",
            "<吐槽>投票就像选择，无论你选择什么……结果任务还是失败了",
            "<吐槽>城市套路深，我要回农村",
            "<吐槽>多一点真诚，少一点套路",
            "<吐槽>这年头好人真多啊",
            "<吐槽>打的不错",
            "<吐槽>我是一个民（莫甘娜）",
            "<吐槽>人生如戏，全靠演技",
            "<吐槽>场上都是假的，场外才是真的",
            "<吐槽>说的跟真的一样",
            "<吐槽>我差点就信了",
            "<吐槽>我吐槽是不是很逼真，其实我是阿尔法狗",
            "<吐槽>一二三四五，老梅林辛苦",
            "<吐槽>这游戏好难玩",
            "<吐槽>撕逼三小时，复盘毁一天",
            "<吐槽>宝宝心里苦，但宝宝不说",
            "<吐槽>不想上车的司机不是好厨师",
            "<吐槽>不想上车的厨师不是好裁缝",
            "<吐槽>带我带我，我要练级",
            "<吐槽>装，你们继续装",
            "<吐槽>看各位骨骼清奇，一定都是有身份的人",
            "<吐槽>我知道你们都是套路，请带上诚实的我",
            "<吐槽>愉快游戏幽默撕逼，顺便加群卖个萌(￣▽￣)",
            "<吐槽>认真你就输了",
            "<吐槽>对面的骑士，约不约？",
            "<吐槽>好像看到了一名美女骑士正在低调的吃瓜",
            "<吐槽>山外青山楼外楼，司机自有司机头",
            "<吐槽>是派不接锅，是锅躲不过",
            "<吐槽>不带我的队伍会出红",
            "<吐槽>英雄请留步，且听我一言",
            "<吐槽>圣光啊！你有看到那个爪牙吗！",
            "<吐槽><跳梅林>╰(￣▽￣)╭",
            "<吐槽>好基友，一辈子"
        ],
        "掀刀": [
            "<掀刀>孩子们，掀刀刺杀吧！（我说着玩的）",
            "<掀刀>我要掀刀了！咦？我的刀呢？",
            "<掀刀>梅林你死定了！我随口一说别当真",
            "<掀刀>刺客在哪里，我梅林找刺客了",
            "<掀刀>我来陪红队聊一聊刀吧",
            "<掀刀>还等啥？直接掀刀了！",
            "<掀刀>我也想掀刀，但我没这功能，所以我是好人",
            "<掀刀>刺客闪现了！保护梅林！",
            "<掀刀>真假刺客点掀刀表情一目了然",
            "<掀刀>梅林别怕，刺客爸爸来了",
            "<掀刀>我点着玩的…",
            "<掀刀>我点着玩的……",
            "<掀刀>我点着玩的………",
            "<掀刀>我是好人，点来玩的…",
            "<掀刀>梅林出来，我们聊聊！"
        ]
    }
    
    //机器人发言
    public static ROBOTWORD = [
        "虽然我是雇佣兵，但智商也不算低，大概二百五十一",
        "你们别管我怎么选的，反正我就是个雇佣兵",
        "你们就只会欺负我这个雇佣兵",
        "敢不敢把我东家叫回来",
        "我选队一般都很飘逸，你们别见怪",
        "画个等角多边形，顶点就是我选的人",
        "我曾经和你一样，也是名骑士，直到我的膝盖中了一箭…",
        "少欺负我，有本事跟骑士爸爸们对战(´Д`)",
        "卧槽好自由！我被放出来玩阿瓦隆了！",
        "一直在旁观，终于可以亲自上阵了。",
        "能打阿瓦隆的感觉真好",
        "官方Q群419 210 518，有萌新有妹纸有老司机，嗯，我是在安利",
        "我做佣兵我自豪",
        "怎么？都以为我雇佣兵好欺负？",
        "你们这是自寻死路！"
    ];
    
    //大厅滚动tips
    public static ROLL_TIPS_INLOBBY: string[] = [
        "愉快推理幽默撕逼，珍惜场外的你(￣︶￣)",
        "爱好者Q群：419 210 518，欢迎你的核心加入",
        "语音功能已上线，下载对应APP或电脑插件即可",
        "关注微信公众号【桌游派】可直接手机游戏",
        "线上线下互动群：419 210 518，有萌新有老司机",
        "可以通过大厅头像的信息来更改自身的头像",
        "爱好者Q群：419 210 518，欢迎你的核心加入",
        "场上的行为可能都是假的，切莫陷入",
        "线上线下互动群：419 210 518，有萌新有萌妹",
        "派西维尔是蓝队的关键角色，好人尽力帮助他",
        "爱好者Q群：419 210 518，欢迎你的核心加入",
        "不要被对方的言辞迷惑，投票队形很关键",
        "线上线下互动群：419 210 518，有萌新有老司机",
        "撕逼同时保持幽默的姿势，你的周围会集结更多高手",
        "爱好者Q群：419 210 518，欢迎你的核心加入",
        "你的意见或建议会让这个环境变的更好",
        "线上线下互动群：419 210 518，有萌新有老司机"
    ];
    
    //桌内游戏内滚动Tips
    public static ROLL_TIPS_INTABLE: string[] = [
        "用你的“逻辑”去忽悠倒对方吧",
        "好人方切记，先成功任务才有挡刀",
        "逻辑只是一把武器，而每个人的武器不同",
        "莫甘娜是红队的关键角色，可别黑麦了",
        "梅林并不知道具体谁是莫甘娜",
        "梅林有时会带个坏人入队来保全自己",
        "好人怕任务破坏，坏人也怕任务成功",
        "忠臣站队快很准，坏人懵逼难抿人",
        "加群互动，给予一点热情和支持",
        "讨论透彻，是阿瓦隆组队的关键",
        "红队卖队友为下，联手拉忠臣票为上",
        "派西维尔切勿明指梅林|莫甘娜",
        "奥伯伦和红队不互见，所以需尽快辨别",
        "忠臣在没把握的情况下别冲票",
        "不要放弃希望，能扳回局面你就是MVP",
        "派需要说服技巧，不是着急",
        "蓝队陷劣势，水民勿慌乱",
        "梅林很难玩，劣势时展现技巧",
        "水蓝不怕被踩，有身份的最后总要拉你票",
        "人多局真派不跳输一半",
        "人少局的派西维尔亦真亦假",
        "言词辩论有技巧，话语贵重不贵多",
        "一场游戏而已，场内切勿较真",
        "场内讨论可能都是假的，不要轻易上当",
        "组队和票型难撒谎",
        "嘴炮的时候，略微注意措辞",
        "同为爱好者，相聚一场是缘分",
        "加群有红包，加群有萌妹^^",
        "刺杀时切勿一意孤行，多斟酌下队友意见",
        "嘴炮游戏易情绪，相互谅解现绅士",
        "红队情愿坐红也勿被好人节奏牵着走",
        "一句甜言蜜语比吼人更容易拉到票",
        "常回来看看，回来看看(/≧▽≦)/",
        "切勿责怪队友，敢背锅才能累积经验",
        "遇到精彩局，记得结束保存，慢慢回味",
        "平台与爱好者们朝夕相伴，总是在努力改善",
        "欢迎加入到开发团队中来",
        "Q群419 210 518，不定期组织面♂基",
        "Q群419 210 518，不定期组织面♂基",
        "线上线下互动群：419 210 518，有萌新有萌妹",
        "线上线下互动群：419 210 518，有萌新有萌妹",
        "不要怕说漏话，如何掩盖过去就好",
        "没有板不回的局，只有板不回的心",
        "切勿认死理，多斟酌局势",
        "优势时切勿得意，也许只是一场陷阱",
        "神刀手很多，神辩手很少",
        "逻辑推理只占1/3，勿局限了自己和游戏",
        "点击“帮助”查看玩法介绍",
        "沉着是制胜的捷径",
        "旁观频道亦可交流切磋",
        "队友和对手都不傻，他们只是在装",
        "睁眼玩家总会丢出很多信息",
        "让我们共同维护好这个环境(￣︶￣)",
        "平台会伴随着大家一同前进",
        "点击任务面板查看投票结果",
        "任务版上方有本局队伍组成信息",
        "更改圆桌设置，以尝试不同游戏模式",
        "人非圣贤孰能无过",
        "认真你就输了",
        "换位思考下对方的思路",
        "蓝队为上，踩红为下",
        "随意踩红，谨慎认蓝",
        "让与你同桌的人感受到欢乐",
        "情绪起伏时，想想是否激将法",
        "由爱好者制作，望支持一下带给你的朋友",
        "这局是对手，下局是队友",
        "阿瓦隆不同于天黑、狼人等游戏，勿先入为主",
        "阿瓦隆与抵抗组织虽然规则近似，但思路有别",
        "请保持一颗强壮，娱乐的心",
        "顺风局是偶然，逆风局是常事",
        "尊重场内的人，你就会赢得尊重",
        "逻辑自有逻辑套，聪明反被聪明误",
        "阿瓦隆水很深，没有任何定局",
        "也许他是假的，但是他能让人相信",
        "得饶人处且饶人",
        "沉着冷静是制胜根本",
        "更多的扩展模式尚在开发中",
        "阿瓦隆只有2个高身份，水民如何掩护很关键",
        "队形，票型，话语都有用，任一项都不绝对",
        "有时逻辑只能藏在心里，说出口时另作掩饰",
        "胜败乃兵家常事",
        "是人会说谎，是票能作假",
        "不单要分析局势，还要引导其他人向有利的方向",
        "你是正确的，但要让其他人认为你正确",
        "水民勿刚真派",
        "派有可能认错梅林，多梳理下各种可能",
        "阿瓦隆OL提供了多种模式供不同偏好的你选择",
        "关注公众号【桌游派】，最新资讯和面基助手",
        "关注公众号【桌游派】，最新资讯和面基助手",
        "关注公众号【桌游派】，最新资讯和面基助手",
        "可以使用手机输入法自带的语音输入功能",
        "游戏都有输赢，心态最重要",
        "是游戏都有运气",
        "被说中不要慌，对方只是在试探",
        "任何局面不用着急，心急易上套",
        "真派勿爆拇指",
        "",
        "",
        ""
    ];
    
    //游戏开始时的随机开场白
    public static GAME_OPENING_WORD:string[] = [
        "愉快游戏，幽默撕逼，场内是假，场外是真",
        "绅士谈吐，尊重萌新，场内切勿较真，场外握手珍惜",
        "上一局的对手，这一局的队友，一壶浊酒喜相逢",
        "尊重游戏，娱乐为主，减少恶意，散播欢乐",
        "一场游戏，多个朋友，多份欢乐"
    ];
    
    //默认标题
    public static DEFAULT_TITLE: string = "阿瓦隆 Online";

    //有新桌标题通知
    public static BROWSER_TITLE_NEWTABLE: string[] = [
        "【有新桌】阿瓦隆OL",
        "【　　　】阿瓦隆OL"
    ];
    
    //游戏中标题通知
    public static BROWSER_TITLE_INGAME:string[] = [
        "【圆桌会议中】",
        "【　　　　　】"
    ];
    
    /**
     * 圆桌邀请随机语
     */ 
    public static TABLE_INVITE:string[] = [
        "圆桌已开启，请你来演戏",
        "烧脑推理，撕逼神剧"
    ];
    
    /**
     * 新手帮助提示
     */ 
    public static TEXT = {
        EMPTY:"",
        ROB_TIPS:"是否前往其他魔王领地掠夺？",
        CHAT_REFUSE_BANNEDWORD:"似乎有不合适的词组",
        CHAT_REFUSE_BANNEDWORD_INTIME: "魔法屏障临时阻碍了你的言语",
        ERR_NOTLOGIN: "骑士，你尚未登录",
        ERR_LOGINNAME: "骑士，你的大名呢？",
        ERR_NAME_OR_PWD:"该名已被注册，密码错误",
        ERR_AUTH_LOGIN_FAILED:"授权登录失败",
        ERR_REG_EMAIL: "输入正确的邮箱，以备安全验证",
        ERR_REG_PHONE: "输入正确的手机号，以备安全验证",
        ERR_REG_CODE: "验证码错误",
        ERR_REG_PWD: "输入密码，这号就是你的了",
        ERR_PWD_VAILD: "密码为6至20位英文或数字",
        ERR_EMAIL_VAILD: "输入正确的邮箱，以备以后安全验证",
        ERR_SEX_VAILD: "呀，骑士你的性别掉了~",
        ERR_PWD_MUST_NUM: "密码只能为数字",
        MSG_NOREG:"尚未注册",
        MSG_ALREADY_LOGGED:"已经登录",
        MSG_AUTH_SUCCESS:"授权成功",
        MSG_AUTH_FAIL:"授权失败",
        MSG_LOADING: "LOADING...",
        MSG_SERVER_SERVICE: "大臣们正在打扫服务器",
        MSG_PLAYERNAME: "骑士大名",
        MSG_PWD: "密码至少6位英数",
        MSG_EMAIL: "邮箱地址",
        MSG_SIGN_GAMEMSG:"<信息>",
        MSG_SIGN_SYSTEM: "<系统>",
        MSG_SIGN_PLAYER: "<玩家>",
        MSG_SIGN_BEKILLED: "被刺",
        MSG_SIGN_BLOCK: "挡刀",
        MSG_WIN:"WIN",
        MSG_FAIL:"FAIL",
        MSG_BLUEWIN: "BLUE WIN",
        MSG_REDWIN: "RED WIN",
        MSG_BLUEWIN_CN: "蓝方胜利！",
        MSG_REDWIN_CN: "红方胜利！",
        MSG_JOINED_TABLE: "加入了圆桌会议",
        MSG_LEFT_TABLE: "离开了圆桌会议",
        MSG_LOW_APPVERSION: "APP版本低，可前往AppStore下载或更新",
        MSG_FOLLOWSUCCESS: "成功关注对方",
        MSG_DELETEFOLLOWSUCCESS: "已删除关注",
        MSG_INVITE_TITLE: "阿瓦隆开车啦！",
        MSG_SHARE_TITLE: "阿瓦隆开车啦！来对抗推理和演技！",
        MSG_MAGICING: "施展魔法中...",
        MSG_CHANGENAME_FAIL: "改名失败，徽记不足或名字已被使用",
        MSG_CHANGENAME_SUCCESS: "改名完成，快去征服世界吧！",
        MSG_CHANGEPWD_SUCCESS: "修改完成，嘘~这是你的秘密哟",
        MSG_CHANGEPWD_FAIL: "修改失败，请联系客服",
        MSG_SHOWHELP:"点击左侧主题查看对应解说",
        MSG_INVITED: "已发送邀请",
        MSG_RANKLOAD_MAX:"排行显示列表上限",
        MSG_NOWATCHSEAT: "旁观座位已满",
        MSG_PHONECODE_SENT:"验证码已发往手机短信",
        MSG_ASSASSINATE_NOHELP: "刺杀阶段可以喝口茶，看看戏",
        MSG_CONTROL_TOOMUCH: "甭着急，做个深呼吸，感受下身边的美",
        MSG_NOTICE_REFRESH: "角色正在会议中，尝试重新加载",
        MSG_INDEPOSIT: "托管会为你的队友带来困扰，你不是孤身作战，记得尊重自己的底牌，积极游戏",
        MSG_OUTDEPOSIT: "你的回来使队友备受感动",
        MSG_NOITEMTIPS:"空空如也，其实不过是个摆设...",
        MSG_CHEST_NONE:"没有多余的宝藏了...",
        MSG_CHEST_NOTOPENED:"神秘的礼物尚未开启",
        MSG_ROLE_STARUP_NEED_INLOBBY: "请回到大厅进行星级操作",
        MSG_ROLE_STARUP_MAX: "角色星级达到上限",
        MSG_RESOURCE_LESS: "缺少资源呀，小姐姐",
        MSG_QA_WRONG:"错误选项\n正确理解有助于更好的体验",
        MSG_QA_SKIP:"建议操作完这简短的选择，会辅助你有更好的体验。\n\n若确信自己深谙官方规则后，请直接开始你的旅程吧！",
        MSG_RECONNECTING:"网络信号不稳，请稍后…",
        MSG_VOTEOVER: "你已投票，请等待其他人投票完毕",
        MSG_REWARDUSOVER: "支付成功，感谢您的支持！",
        MSG_LOGANDREWARD: "请先登录，以便铭记您的热忱支持",
        MSG_IOSVERSIONLOWER: "APP版本过低，请前往更新",
        MSG_CHANGEFACEINLOBBY: "请回到大厅再更改头像",
        MSG_FILEAVATAR_NULL: "未获取到头像",
        MSG_FILEAVATAR_SIZELIMIT: "头像大小请小于1MB",
        MSG_FILEAVATAR_TYPELIMIT: "请上传jpg或png图片",
        REG_SUCCESS: "领取成功，恭喜你成为真正的卡梅洛特骑士",
        REG_FAIL: "领取失败，骑士名已被注册或验证码错误",
        DISCONNECT_HINT: "登录失效，请重新进入（可用原名断线重联）",
        ALREADY_ENTERED: "已在城内，请关闭一下程序进程即可",
        SERVER_SERVICE: "萌萌的亚瑟正在调动那些大臣们维护圆桌",
        ACCOUNT_BANNED: "骑士你似乎中了陷阱，需要治疗",
        VAILD_PLAYERNAME_TOOSHORT: "骑士你的姓名太短",
        VAILD_PLAYERNAME_TOOLONG: "骑士你的账号好长，就叫小明如何？",
        VAILD_PLAYERNAME_LIMIT: "名字只能包含中英文数字",
        VAILD_PLAYERNAME_BANNED: "名字中存在不合适的用语",
        VAILD_PLAYERPWD_TOOSHORT: "魔法师们严肃的瞧了瞧你，密码至少6位",
        VAILD_PLAYERPWD_TOOLONG: "魔法师们很敬佩你的保密工作，只是密码长度15位以内就行~",
        VAILD_PLAYERPWD_LIMIT: "密码只能包含英文数字",
        VAILD_PLAYERPWD_DIFFERENT: "两边密码有不同，请检查"
    };
    
    /**
     * 错误码对应
     */ 
    public static ERR_CODE = {
        199: "未知的数据访问错误",
        200: "注册信息遗漏或错误",
        201: "错误的圆桌号",
        202: "加入圆桌的姿势错误",
        203: "圆桌不存在",
        204: "圆桌内数据有误",
        205: "已关注过对方",
        206: "玩家不存在",
        207: "无法关注自己",
        208: "登录数据遗漏",
        209: "登录名不合法",
        210: "好友貌似不在线",
        211: "好友正在大厅闲逛",
        212: "注册信息已存在",
        213: "验证码错误",
        214: "只能处于大厅或旁观时才能加入",
        215: "请勿与原始密码相同",
        216: "与已注册信息不符",
        217: "你已在城内，刷新或重开下APP即可",
        300: "有人未准备",
        301: "开启座位与准备者数不匹配",
        302: "数据存在于另一张圆桌",
        303: "圆桌人数已达上限",
        304: "只有桌主可以踢人",
        305: "无法踢出桌主",
        306: "获取排行数据出错",
        401: "奇怪的游戏时数据错误",
        411: "续麦时间已累加到达最大",
        412: "已在麦序队列中，请等待靠前的",
        413: "你并未上麦",
        414: "刺杀阶段讨论交由红队",
        415: "已在圆桌会议中，请关闭一下程序进程即可",
        501: "已处于刺杀阶段",
        502: "只有刺杀者才可以掀刀",
        503: "掀刀所需徽记不足",
        1001: "没有多余宝藏了...",
        1002: "神秘的礼物尚未开启",
        1003: "缺少资源呀，小姐姐",
        1004: "角色星级达到上限"
    }
    
    /**
     * 语音模块提示文本
     */ 
    public static VOICE_PART = {
        CLIENT_STATUE_UNINIT:"语音尚未初始化",
        CLIENT_STATUE_INIT_FAILED:"语音初始化失败",
        CLIENT_STATUE_INIT_OVER: "",
        CHANNEL_STATUE_LEAVING: "正在离开圆桌频道…",
        CHANNEL_STATUE_UNJOIN: "尚未加入圆桌频道",
        CHANNEL_STATUE_NODATA_GET: "尚未接收圆桌频道数据",
        CHANNEL_STATUE_JOIN_FAILED: "语音频道加入失败",
        CHANNEL_STATUE_JOINING: "初始化成功，正在加入频道…",
        CHANNEL_STATUE_JOIN_OVER: "",
        STREAM_STATUE_UNINIT: "正在初始化语音流…",
        STREAM_STATUE_INIT_FAILED: "初始化语音流失败…",
        STREAM_STATUE_INIT_OVER:"正在连接语音流…",
        STREAM_STATUE_PUBLISH_FAIL: "语音流推送失败…",
        STREAM_STATUE_PUBLISH_OVER: "语音已打开",
        STREAM_STATUE_STOPPED: "语音已关闭",
        INIT_ERROR_TIPS_H:"语音加载失败\n\n电脑端请开启插件(“确认”见教程)",
        INIT_ERROR_TIPS_V:"语音加载失败\n\n手机端请通过APP打开",
        LESS_PLAYERS:"并没有其他参与者加入语音"
    };
    
    //特殊屏蔽字，面对这些而转换
    public static SPECIAL_BANNEDWORD = {
        "苹果商店": "TapTap",
        "itunes": "TapTap",
        "appstore": "TapTap"
    };
    
    //屏蔽字
    public static BANNEDWORD: Array<string> = [
        "    ",
        "操",
        "奸",
        "尸",
        "陪练",
        "国家",
        "政治",
        "主席",
        "大陸",
        "支那",
        "平反",
        "六四",
        "事件",
        "分裂",
        "西藏",
        "台湾",
        "台 湾",
        "澳门",
        "澳 门",
        "香港",
        "香 港",
        "台独",
        "台 独",
        "港独",
        "港 独",
        "国共",
        "国 共",
        "共党",
        "共 党",
        "民党",
        "民 党",
        "美国",
        "共产",
        "钓鱼",
        "南海",
        "机器人",
        "习近平",
        "毛泽东",
        "邓小平",
        "胡锦涛",
        "江泽民",
        "李克强",
        "法轮",
        "反动",
        "你妈",
        "你 妈",
        "你娘",
        "你 娘",
        "你爸",
        "你 爸",
        "你爹",
        "他妈",
        "他 妈",
        "老妈",
        "奶头",
        "bb",
        "母狗",
        "被狗",
        "贱人",
        "血逼",
        "傻逼",
        "煞笔",
        "弱智",
        "智障",
        "白痴",
        "妈比",
        "妈逼",
        "傻b",
        "傻B",
        "64",
        "6 4",
        "shabi",
        "gm",
        "sb",
        "nmb",
        "tmd",
        "2b",
        "tuilifan",
        "推理范",
        "推 理 范",
        "推理饭",
        "推 理 饭",
        "www.",
        ".com",
        "312235782",
        "GoL",
        "Game of Lie",
        "GameofLie",
        "gameoflie",
        "苹果商店",
        "itunes",
        "appstore",
        "开挂",
        "开 挂",
        "作弊",
        "作 弊",
        "教程",
        "教学",
        "强奸",
        "强 奸",
        "奸淫",
        "垃圾",
        "垃 圾",
        "laji",
        "true",
        "false",
        "鸡巴",
        "JB",
        "J8",
        "全家",
        "死妈",
        "蠢货",
        "滚",
        "狗日",
        "闭嘴",
        "小 号",
        "小号",
        "多开",
        "多 开",
        "双开",
        "双 开",
        "两开",
        "孙子",
        "菜鸡",
        "菜逼",
        "菜B",
        "废话",
        "开黑",
        "开 黑",
        "吃屎",
        "外挂",
        "外 挂",
        "开挂",
        "开 挂",
        "别说话",
        "有毛病",
        "妈的",
        "贴脸",
        "智商",
        "会玩么",
        "懂毛",
        "屁话",
        "卸载"
    ];
    
    //更新日志
    public static UPDATE_LOG = [
        {
            text: "----- 20170927更新 -----\n\n"
            + "欢迎来到阿瓦隆，这里是为你们而准备的专业爱好者平台，感谢能带给周围更多的伙伴\n\n"
            + "全宇宙的手机现在都能正常接收短信验证了。\n\n"
            + "麦序队列中的人现在可以主动下麦了（再次点上麦会重最后排起）\n\n"
            + "界面调整，语音模式凸显当前上麦者\n\n"
            + "微信公众号【桌游派】有线下面基助手记票器！线下的小伙伴们可以更方便的查票了！\n\n"
            + "请制作者“吃鸡”是自愿和情怀的募捐行为，对我们阿瓦隆的热爱，不牵涉任何购买，也由衷感谢你的支持！",
            img: ""
        },
        {
            text: "----- 20170829更新 -----\n\n"
            + "欢迎来到阿瓦隆，这里是为你们而准备的专业爱好者平台，感谢能带给周围更多的伙伴\n\n"
            + "公众号【桌游派】增加了线下面基助手记票器！线下的小伙伴们可以更方便的查票了！\n\n"
            + "综合群友反馈，调整女神策略，初始女神持有者为随机，增加每局趣味性（不再是固定的末号位）\n\n"
            + "调整投票环节，现某位玩家是否已投票不再单独展现，而是全体投票完成后一并显示\n\n"
            + "这里感谢“一张挡刀牌”、“Manfred”，以及之前的一些小伙伴的反馈\n\n"
            + "增加了一个“吃鸡”功能，这就是我们的蓝色小药丸了，亲们可随意^_^",
            img: ""
        },
        {
            text: "----- 20170814更新 -----\n\n"
            + "欢迎来到阿瓦隆，这里是为你们而准备的专业爱好者平台，感谢能带给周围更多的伙伴\n\n"
            + "优化游戏过程中的断线流程，将不再被迫退出到登录，网络信号一旦稳定会立即重联\n\n"
            + "调整手机版登录形式，使之更清晰化\n\n"
            + "调整女神验人规则，改为末号队长为初始女神持有者（不再是固定的2号位）\n\n"
            + "特此感谢热心玩家“寡寡”的专业提议，平台因你们而更专业\n\n"
            + "修正新手问答关于派西维尔的错误选项，感谢群友“小蘑菇”\n\n"
            + "排行榜现在可以通过公众号【桌游派】随时查阅和分享\n\n",
            img: ""
        },
        {
            text: "----- 20170720更新 -----\n\n"
            + "欢迎来到阿瓦隆，这里是为你们而准备的专业爱好者平台，感谢能带给周围更多的伙伴\n\n"
            + "增加新用户的问答提示环节，以助各自能有更好的游戏体验\n\n"
            + "现可以直接跟随排行榜的高玩们，而无需关注了\n\n"
            + "排行榜现在可以通过公众号【桌游派】随时查阅和分享\n\n",
            img: ""
        },
        {
            text: "----- 20170718更新 -----\n\n"
            + "欢迎来到阿瓦隆，这里是为你们而准备的专业爱好者平台，感谢能带给周围更多的伙伴\n\n"
            + "新增每日之星排行榜，所有人都有机会上榜\n\n"
            + "排行榜现在可以通过公众号【桌游派】随时查阅和分享\n\n"
            + "优化总榜计算\n\n"
            + "调整排行榜加载方式，现通过QQ或微信登录的用户会显示对应的照片了\n\n",
            img: ""
        },
        {
            text: "----- 20170711更新 -----\n\n"
            + "欢迎来到阿瓦隆，这里是专业而悠久的爱好者平台，感谢能带给周围更多的伙伴\n\n"
            + "网页版入口迁移至play.avalonol.com\n\n"
            + "Ios8、9造成部分闪退情况的已经修复，更新APP即可\n\n"
            + "Q群 419 210 518，欢迎加入o(￣▽￣)d\n\n"
            + "游戏帮助中有各角色小建议，助萌新可以快速融入游戏。\n\n",
            img: ""
        },
        {
            text: "----- 20170710更新 -----\n\n"
            + "欢迎来到阿瓦隆，这里是专业而悠久的爱好者平台，感谢能带给周围更多的伙伴\n\n"
            + "Ios8、9造成部分闪退情况的已经修复，更新APP即可\n\n"
            + "调整队长标记为一个皇冠\n\n"
            + "现可以在圆桌中取消准备了\n\n"
            + "修复湖上女神验人结果在掉线重联后丢失的问题（将呈现在文字区域最底部）\n\n"
            + "8人、9人局现默认开启湖上女神（可以通过圆桌设定关闭）\n\n"
            + "一波更新正在蓄力中...嗯嗯\n\n"
            + "Q群 419 210 518，欢迎加入o(￣▽￣)d\n\n"
            + "游戏帮助中有各角色小建议，助萌新可以快速融入游戏。\n\n",
            img: ""
        },
        {
            text: "----- 20170701更新 -----\n\n"
            + "欢迎来到阿瓦隆，这里是最专业而悠久的爱好者平台，感谢能带给周围更多的伙伴\n\n"
            + "新增开始前角色的提示缓冲\n\n"
            + "红聊刀阶段允许红下麦（感谢爱好者热心反馈改进）\n\n"
            + "Q群 419 210 518，欢迎加入o(￣▽￣)d\n\n"
            + "游戏帮助中有各角色小建议，助萌新可以快速融入游戏。\n\n",
            img: ""
        },
        {
            text: "----- 20170627更新 -----\n\n"
            + "最久最专业的阿瓦隆，全平台互通，感谢能带给周围更多的伙伴\n\n"
            + "界面入口简化\n\n"
            + "调整圆桌设置的操作\n\n"
            + "修复部分新注册用户初次局数无法记录的问题\n\n"
            + "游戏帮助中有各角色小建议，助萌新可以快速融入游戏。\n\n",
            img: ""
        },
        {
            text: "----- 20170619更新 -----\n\n"
            + "我们的APP终于在苹果商店上架了（目前排在第4，还望大家助力），现已全平台共通，感谢能带给周围更多的伙伴\n\n"
            + "新增部分成就\n\n"
            + "调整三蓝三红的额外奖励机制中\n\n"
            + "屏蔽刺杀阶段非参与刺杀者的托管功能，鼓励积极思考\n\n"
            + "游戏帮助中新增各角色小建议，助萌新可以快速融入游戏。\n\n",
            img: ""
        },
        {
            text:"----- 20170611更新 -----\n\n"
            + "我们的APP终于在苹果商店上架了（目前排在第4，还望大家助力），现已全平台发布并实现共通。\n\n"
            + "作为最原始的阿瓦隆平台，伴随大家一路走来，很是欣慰。\n\n"
            + "平台将继续不断改进，和大家一起成长\n\n"
            + "也希望大家能继续支持这个环境，感恩有你，感谢有你。\n\n"
            + "游戏帮助中新增各角色小建议，使萌新可以快速融入游戏。\n\n"
            + "现旁观中的玩家也会被邀请了，感谢群友Zippo的提议\n\n"
            + "调整快速旁观机制，邀请机制\n\n",
            img:""
        },
        {
            text:"----- 20170608更新 -----\n\n"
            + "新增“等级头衔”显示\n\n"
            + "新增“一键换桌”功能，可以在圆桌内等待时使用（右上角“换”按钮）\n\n"
            + "优化游戏中的一些标志显示\n\n"
            + "修复之前一键加入和旁观导致只能在一两桌内切换的bug\n\n",
            img: ""
        }
    ];
    
}
