import short from 'short-uuid'

export default function generateUUID(prefix = '', suffix = ''): string {
	return prefix + short.generate() + suffix
}

// tslint:disable-next-line:max-line-length
export const baseHans = short(
	'的一是了不在有人上这大我国来们和个他中说' +
	'到地为以子小就时全可下要十生会也出年得你' +
	'主用那道学工多去发作自好过动对行里能二天' +
	'三同成活太事面民日家方后都于之分经种还看' +
	'产所起把进前着没而样部长又问法从本定见两' +
	'新现如么力等电开五心只实社水外政很高月业' +
	'当义些加老著四头因向理点合明无机意使第正' +
	'度物想体此知关制然其表重化应各但者间百比' +
	'什儿公做九相气命西话将内与由利今手平量员' +
	'回情几最八级位结性代教次路党六便原军总走' +
	'象口七先常题入给己队战果完反白建革立少文' +
	'打论门东女放期真数展资通农名解叫提或山线' +
	'条别万系已变形它边阶报官决她及争声北求世' +
	'耍美再听才运必安取被南接华干区身济共计特' +
	'改吃书马组界议车并海育思设件光强品直许造' +
	'务流治领联金记任受极基质指帮目市快千导花' +
	'科难深保住统管处认志图则研劳每场带亲至根' +
	'更斗收信究且怎近非料何呢热术夫眼交布石达' +
	'步拉众省风据奸增程火团字却油米委色式切望' +
	'器办群观算调母土较请元爱持清广张连压觉识' +
	'林际举即死专局类空单权毛师商孩装批府找往' +
	'王校该未席约照易神克号京转须半习青早规验' +
	'拿服节精树传备钱技讲告德参斯具织集病友谈' +
	'示积亚复厂越支婚历兵胜选整铁势笑院板球河' +
	'吗除准况影倒若格断甚速言采哪离县写台古远' +
	'士感般呀低确晚害细标兴房游消够坐足史飞注' +
	'紧食列失候周破推温英喜片苏首价双赛证木角' +
	'族苦引始哥跟念故助容需落草项功送巴船罢鱼' +
	'虽音试包洋怕似养满防红修田妇银城职止希查' +
	'江站村曾黑段随费黄父续乐块买衣型状视愿投' +
	'司欢效响刻存尽跑坚差滑武纪围阿层划企客底' +
	'屋阳律妈派啊护施富像留让敌吧供皮维值既例' +
	'显旧啦谁尺云副男致适协靠艺脚换配宽迫洲久' +
	'急弟答严轮孔击款息扬叶轻朝率责营雨监忙称' +
	'继固渐医良初刀星按坏帝负待姑夜属密简排均' +
	'财免旅错姐归令余读创置益穿端抗独某判闻敢' +
	'午冷材春守虫仅态圆岁预宣略源素矿充刚语左' +
	'考仍恩烟构乡酒付画座君逐卖卫跳绝朋降李占' +
	'汽药货救另获微伤奇减策句赶承州终娘案诉右' +
	'依短察芬优杂波居爷限呼停互章纸封央脸普瓶' +
	'演室背饭借顶肯乱班诸床乎善环您困吸假齐福' +
	'慢血激毫担桥讨凭印钟鲜掉零童怪戏述汉尼含' +
	'散杀恶斤肉肆牛模液罪评检范睛亦茶香访射烧' +
	'灯兰沙针罗旁替脑输烈练境努径升钢哭突恐贵' +
	'植粉酸削丝误野礼巷冲测麦露否登危搞歌亮欧' +
	'痛唱玩肥超菜攻鼓退藏谢哈暗缺户迎堂训陈敬' +
	'馆险妹移弹景顾课惊播挥熟票夺培棉夏灭抓味' +
	'松掌架静曲粮束赞犯忽编异翻促套脱鼠祖尚尤' +
	'嘴础伟骨潮载威阵闹园磨玉鸡侵竟概抵季执冬' +
	'核补孙遇兄辨弄讯丰顺宝庄永毒托睡枝洞录港' +
	'宗纳甲盖胡倍稳届附庭泥镇贫岛毕洗笔煤亿卡' +
	'盘弱街损耳控狗晓铜末镜楼败航寻湖恼介宁招' +
	'凤爸咱蒙混麻昨雷份索店探舞摇横凡岸莫龙沿' +
	'临启盛操羊雄销伸鸟奶塞额吹幕途陆筑齿扩括' +
	'缘阻阴拜猪旗绿氏私冰聪谋穷献沉抢灰践奋警' +
	'秋召绩敞触休瓦征疑残析透欲壁狠剧牙幸苗氧' +
	'妻怀喝荣篇订巨贸顿版剂瞧挂摆楚税厚抱握虎' +
	'健卷胞刺忘炉逃缩偏隔聚窗庆寨追序喊软闭刘' +
	'亩醒伯遍抽杆亡盾唯枪杯姓谷硬灵晨袋皆圈域' +
	'鲁勇暴雪恨械惯寸津绍佛墙粒染井乙薄奖奴乃' +
	'迅汗映猫彩蛋牌盐距桌股吨皇奏辛伐涉箱网盟' +
	'振秩寒净博泪拆诗矛裂湿尊延彻幼番劝糠洁稻' +
	'粗禁遣尾菌废裁燃伙愈丹瞒徒拍捉汇牧珠稿灾' +
	'浪援怒堆避怜纯智丽雕铺驻拖康典妙岩浅抬坦' +
	'瓜杨壮俗彼督耐勒赵剥虚钻乘繁勤殖贝贯脉兔' +
	'纷尖缓圣遗祝迷洪库惜炮择竹忍览渡辆柱碎池' +
	'旋川塔耕柴审辞插债湾震纵呆株宫遭签允扫累' +
	'鞋螺奔贡宜擦暖趣润侧冒猛迹骂旱豆帽爬迟饮' +
	'巧乌鬼释寄仪慌悟甘壤诚淡冠沈梦荷页丈伍懂' +
	'祥爆厅碗滚授玻奉捕乏扎墨词夹摄仙艰秘泻倘' +
	'婆唤垂愁喷炼糊涂叹丁壳泰鸣予倾贺舍虑秀朗' +
	'售腿妄稍奥辈辟斜叔宪腐幅挑锦劲璃腰浓乒阀' +
	'吉森荒邻泛蜂闪灌疗隶竞耗卵辩剩厘割添颜障' +
	'臣吴扇亏拔珍黎胶绕仁偷伏仔暂荡欺违棒患贴' +
	'骗貌潜浮赏锋晶拥殊唐赤宾默刑币鼻污泼祸刊')
